app/views/shots/show.html.haml

SELECT COUNT(*) FROM "comments" WHERE "comments"."shot_id" = 2
---
    .comments
      - if @shot.comments.count == 0

SELECT "rebounds".* FROM "rebounds" ORDER BY "rebounds"."id" DESC LIMIT 1
---

-@shot.rebounds.each do |r|