app/views/shared/_shot_thumb.html.haml

SELECT COUNT(*) FROM "comments" WHERE "comments"."shot_id" = 3
---
          %i.icon-comment
          = c.comments.count