app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "created_at", "shot_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "love it"], ["created_at", Thu, 18 Jul 2013 05:37:21 UTC +00:00], ["shot_id", 3], ["updated_at", Thu, 18 Jul 2013 05:37:21 UTC +00:00], ["user_id", 3]]
---
  def create
    @comment = Comment.new(params[:comment])
    @comment.user_id = current_user.id
    if @comment.save