app/controllers/shots_controller.rb

  def index
    if params[:tag]
      @shots = Shot.tagged_with(params[:tag])
      @tag = params[:tag]
    else
      @shots = Shot.order()
---
SELECT "tags".* FROM "tags" WHERE (lower(name) = 'bomb')