app/controllers/shots_controller.rb

SELECT "shots".* FROM "shots" JOIN taggings shots_taggings_106a360 ON shots_taggings_106a360.taggable_id = shots.id AND shots_taggings_106a360.taggable_type = 'Shot' AND shots_taggings_106a360.tag_id = 1 ORDER BY created_at DESC LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "shots"
---
  def index
    if params[:tag]
      @shots = Shot.tagged_with(params[:tag]).page(params[:page]).order('created_at DESC')

SELECT "shots".* FROM "shots" WHERE "shots"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @shot = Shot.find(params[:id])

SELECT "shots".* FROM "shots" WHERE "shots"."id" = ? LIMIT 1  [["id", "4"]]
---
  def rebound
    if current_user
      @rebound_shot = Shot.find(params[:id])

SELECT "shots".* FROM "shots" WHERE "shots"."id" = ? LIMIT 1  [["id", "20"]]
INSERT INTO "shots" ("audio_content_type", "audio_file_name", "audio_file_size", "audio_updated_at", "created_at", "description", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "rebounds" ("created_at", "from_shot_id", "to_shot_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 18 Jul 2013 05:58:27 UTC +00:00], ["from_shot_id", nil], ["to_shot_id", nil], ["updated_at", Thu, 18 Jul 2013 05:58:27 UTC +00:00]]
---
  def create_rebound
    @shot = Shot.new(params[:shot])
    @shot.user_id = current_user.id
    @rebound_shot = Shot.find(params[:id])
    if @shot.save
    #If save succeeds return to list action
      Rebound.create(:from_shot_id => @rebound_shot.id, :to_shot_id => @shot.id)

INSERT INTO "shots" ("audio_content_type", "audio_file_name", "audio_file_size", "audio_updated_at", "created_at", "description", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @shot = Shot.new(params[:shot])
    @shot.user_id = current_user.id
    if @shot.save

SELECT "shots".* FROM "shots" WHERE "shots"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "shots" WHERE "shots"."id" = ?  [["id", 3]]
---
  def destroy_shot
    shot = Shot.find(params[:id])
    shot.destroy