app/controllers/shots_controller.rb

  def show
    @shot = Shot.find(params[:id])
    @comment = Comment.new( :shot => @shot )
    @rebounds = Rebound.order()
---
SELECT "rebounds".* FROM "rebounds" ORDER BY "rebounds"."id" DESC LIMIT 1