app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "shots".* FROM "shots" WHERE "shots"."user_id" = 2 ORDER BY created_at DESC LIMIT 8 OFFSET 0
---
  def show
    @user = User.find(params[:id])
    @user_shots = @user.shots.page(params[:page]).order('created_at DESC')